app/views/employees/_form.html.erb

<script>
$(document).ready(function(){
	$(".checkme").click(function(event){
		var x = $(this).is(':checked');
		if (x == true) {
			$(this).parents(".checkbox-contacts").find('.contacts').show();
		}
		else{
			$(this).parents(".checkbox-contacts").find('.contacts').hide();
		}
	});
})
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."employee_id" = $1  [["employee_id", 6961]]