app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" ORDER BY "employees"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "job_roles".* FROM "job_roles" WHERE "job_roles"."id" IN (1, 2, 3, 4, 5)
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."id" IN (1, 2)
SELECT COUNT(*) FROM "employees"
---
  def index
    @employees = Employee.includes(:workspace, :job_role).paginate(page: params[:page]).order('created_at desc')

SELECT  "employees".* FROM "employees" WHERE "employees"."workspace_id" = $1 AND "employees"."job_role_id" = $2 LIMIT $3 OFFSET $4  [["workspace_id", 2], ["job_role_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "job_roles".* FROM "job_roles" WHERE "job_roles"."id" IN (1, 2, 3, 4, 5)
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."id" IN (1, 2, 3)
SELECT COUNT(*) FROM "employees" WHERE "employees"."workspace_id" = $1  [["workspace_id", 2]]
SELECT  "employees".* FROM "employees" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
  def search
    add_breadcrumb('Pessoas', employees_path)
    add_breadcrumb('Pesquisar Pessoa')
    @employees = Employee.includes_workspace_and_job_role(params[:page]).where(nil)
    filtering_params(params).each do |key, value|
      @employees = @employees.public_send("filter_by_#{key}", value) if value.present?

INSERT INTO "employees" ("id", "full_name", "birth_date", "origin_city", "home_state", "marital_status", "sex", "workspace_id", "job_role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "origin_city" = $1, "home_state" = $2, "sex" = $3, "updated_at" = $4 WHERE "employees"."id" = $5  [["origin_city", "Goiânia"], ["home_state", "GO"], ["sex", "Masculino"], ["updated_at", "2023-08-08 13:18:20.535032"], ["id", 7592]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT "employees".* FROM "employees"
---
    def set_sexes
      @sexes = Employee::SEXES.map do |sex| sex

SELECT "workspaces"."title", "workspaces"."id" FROM "workspaces"
---
    def set_workspaces
      @workspaces = Workspace.all.pluck(:title, :id)

SELECT "job_roles"."title", "job_roles"."id" FROM "job_roles"
---
    def set_job_roles
      @job_roles = JobRole.all.pluck(:title, :id)